Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/worksheets/worksheet_on_calculating_your_redundancy_payment.html.txt.tmx
Source language: en
Languages: ga

source: Worksheet on calculating your redundancy payment
ga: Bileog oibre maidir le d’íocaíocht iomarcaíochta a ríomh

source: (for example, 30 June 2014) ------------
ga: (mar shampla, 30 Meitheamh 2014) --------------

source: Date you started work
ga: An dáta ar a thosaigh tú ag obair

source: (for example, 1 April 2004) --------------
ga: (mar shampla, 1 Aibreán 2004) --------------

source: Number of full years' service
ga: Líon na mblianta iomlána seirbhíse

source: (for example, 10 years) --------------
ga: (mar shampla, 10 mbliana) ---------------

source: Number of days in part of a year's service
ga: Líon na laethanta i gcuid de bhliain seirbhíse

source: (total of days in every incomplete year worked
ga: (líon iomlán na laethanta i ngach bliain neamhiomlán atá oibrithe

source: for example, 1 April 2014 to 30 June 2014 = 3 months = 91 days) ---------------
ga: (mar shampla, 1 Aibreán 2014 go 30 Meitheamh 2014) = 3 mhí = 91 lá) ---------------

source: Deduct any non-reckonable service
ga: Déan seirbhís neamh-inríofa a bhaint

source: (see Redundancy payments for details
ga: (féach Íocaíochtaí iomarcaíochta le haghaidh sonraí

source: for example, 30 weeks' sick leave in 2012, 4 weeks is
ga: mar shampla, 30 seachtain saoire breoiteachta in 2012, tá 4 seachtaine

source: 4 weeks = 28 days) ----------------
ga: 4 seachtaine = 28 lá) ---------------

source: (for example, 10 years, 63 days (91-28) ----------------
ga: (mar shampla, 10 mbliana, 63 lá (91-28) ---------------

source: Total of the days in a part year as percentage of a year
ga: Líon iomlán na laethanta i gcuid de bhliain mar chéatadán de bhliain

source: (for example, 63 ÷ 365 x 100 = 17.26%) ----------------
ga: (mar shampla, 63 ÷ 365 x 100 = 17.26%) ---------------

source: (for example, 10.17 years) ----------------
ga: (mar shampla, 10.17 bliain) ---------------

source: Amount of your normal weekly pay
ga: Méid de do ghnáthphá seachtainiúil

source: (gross pay, that is, before tax and PRSI deducted
ga: (pá comhlán, .i. sula ndéantar cáin agus ÁPSC a bhaint

source: for example, €700, ceiling on weekly pay is €600) ----------------
ga: mar shampla, €700 Is é an uasteorainn atá ar phá seachtainiúil ná €600) ---------------

source: Statutory redundancy lump sum payment due
ga: An íocaíocht chnapshuime iomarcaíochta reachtúil atá iníoctha

source: (2 weeks' pay for each year of service + one extra week
ga: (pá 2 sheachtain in aghaidh na bliana seirbhíse + aon seachtain amháin breise

source: for example, 2 weeks x 10.17 = 20.34 + 1 week = 21.34 weeks
ga: mar shampla, 2 sheachtain x 10.17 = 20.34 + 1 sheachtain = 21.34 seachtain

source: Example lump sum due is €12.804 (€600 x 21.34) ----------------
ga: Is í an chnapshuim shamplach atá iníoctha ná €12.804 (€600 x 21.34) ---------------

source: You can also use this online redundancy calculator on welfare.ie to help you to calculate your statutory redundancy entitlement
ga: Tig leat an táireamhán iomarcaíochta ar líne seo a úsáid chun do theidlíocht a áireamh le haghaidh iomarcaíochta reachtúla
